
Функция ОтправкаСообщенийВТелеграм(ТекстСообщения) Экспорт
	
	КонстантаПортТелеграм = 443;
    КонстантаКодУспеха = 200;
    
	ТокенБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ChatId = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	АдресСайта = "api.telegram.org";
    ПутьРесурса = "/bot" + ТокенБота + "/sendMessage";  
	
	Соединение = Новый HTTPСоединение(АдресСайта, КонстантаПортТелеграм, , , , 10, Новый ЗащищенноеСоединениеOpenSSL());
	
	Запрос = Новый HTTPЗапрос(ПутьРесурса);

	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Параметры = Новый Структура;
	Параметры.Вставить("chat_id", ChatId);
	Параметры.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Параметры);
	JSONСтрока = ЗаписьJSON.Закрыть();

	Запрос.УстановитьТелоИзСтроки(JSONСтрока, "UTF-8");
		
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
    Если Ответ.КодСостояния <> КонстантаКодУспеха Тогда
        Комментарий = "Ошибка отправки сообщения в Telegram: " + Ответ.ПолучитьТелоКакСтроку();
		Сообщить(Комментарий);
		ЗаписьЖурналаРегистрации("HTTP Запрос",УровеньЖурналаРегистрации.Ошибка,,,	Комментарий);
	КонецЕсли;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции

Процедура ПолучитьСообщенияДляОтправки() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КодСостояния = ОтправкаСообщенийВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения); 
		
		Если КодСостояния = 200 Тогда
			
			Ссылка = ВыборкаДетальныеЗаписи.Ссылка; 
			Объект = Ссылка.ПолучитьОбъект();
			Объект.Удалить();
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры
