#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) Экспорт
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		ВсегоНачислено = Выплаты.Итог("Начислено");
		ВсегоВыплачено = Выплаты.Итог("Выплачено");
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками Расход 
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
			Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
			Движение.Результат = ТекСтрокаВыплаты.Выплачено;
		КонецЦикла;
		
	КонецПроцедуры 
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура ОчиститьРегистр() Экспорт  
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
		
	КонецПроцедуры
	
	#КонецОбласти	
	
#КонецЕсли
