
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
		
		Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
			
			КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
			КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
			КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
			КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
			
			Возврат КомандаСоздатьНаОсновании;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецФункции
	
	// ++ Алекситович Д.Н. 22.04.2026 Добавление печати Акта
	Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт	
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	КонецПроцедуры
	
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Акт";
		КомандаПечати.Представление = НСтр("ru = 'Акт'");
		КомандаПечати.Порядок = 10;
		
	КонецПроцедуры  
	
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Акт");
		Если ПечатнаяФорма <> Неопределено Тогда
			ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
			ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт'");
			ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ВКМ_Акт";
		КонецЕсли;
		
	КонецПроцедуры
	// --
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_Акт");
		
		ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
		
		ПервыйДокумент = Истина;
		
		Пока ДанныеДокументов.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);		
			
		КонецЦикла;	
		
		Возврат ТабличныйДокумент;
		
	КонецФункции   
	
	Процедура ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
		
		ДанныеПечати = Новый Структура;
		
		ШаблонЗаголовка = "Акт № %1 от %2";
		ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДФ='dd.MM.yyyy '"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
		ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент); 
		ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
		
		ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
		
	КонецПроцедуры
		
	Процедура ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("УслугиШапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("УслугиСтрока");
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
		
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		ДанныеПечатиИтого = Новый Структура;
		ДанныеПечатиИтого.Вставить("Всего", ДанныеДокументов.СуммаДокумента);
		
		ОбластьИтого.Параметры.Заполнить(ДанныеПечатиИтого);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		ДанныеПечатиСуммаПрописью = Новый Структура;
		СуммаПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента, "Л=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ДанныеПечатиСуммаПрописью.Вставить("СуммаПрописью", СуммаПрописью);
		
		ОбластьСуммаПрописью.Параметры.Заполнить(ДанныеПечатиСуммаПрописью);
		ТабличныйДокумент.Вывести(ОбластьСуммаПрописью);
		
		
	КонецПроцедуры
		
	Процедура ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьПодвалАкта = Макет.ПолучитьОбласть("Подвал");
		
		ТабличныйДокумент.Вывести(ОбластьПодвалАкта);
		
	КонецПроцедуры
	
	Функция ПолучитьДанныеДокументов(МассивОбъектов)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Дата КАК Дата,
		|	РеализацияТоваровУслуг.Номер КАК Номер,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
		|	РеализацияТоваровУслуг.Услуги.(
		|		НомерСтроки КАК НомерСтроки,
		|		Ссылка КАК Ссылка,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма) КАК Услуги
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка В (&МассивОбъектов)";
		
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		Возврат Запрос.Выполнить().Выбрать();
		
	КонецФункции
	
	// ++ Алекситович Д.Н. 24.04.2026 Добавление Автозаполнения
	Процедура ВКМ_ВыполнитьАвтозаполнение(Ссылка) Экспорт
		
		НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
		НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		
		Если НоменклатураАбонентскаяПлата.Пустая() И НоменклатураРаботыСпециалиста.Пустая() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Автозаполнение невозможно: необходимо заполнить константы Абонентская плата и Работы специалиста";
			Сообщение.Сообщить();
			Возврат;
			
		ИначеЕсли НоменклатураАбонентскаяПлата.Пустая() Тогда	
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Автозаполнение невозможно: необходимо заполнить константу Абонентская плата";
			Сообщение.Сообщить();
			Возврат;
			
		ИначеЕсли НоменклатураРаботыСпециалиста.Пустая() Тогда	
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Автозаполнение невозможно: необходимо заполнить константу Работы специалиста";
			Сообщение.Сообщить();
			Возврат;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК АбонентскаяПлата,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ПОМЕСТИТЬ ВТ_Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДействуетС < &ДатаКонца
		|	И ДоговорыКонтрагентов.ВКМ_ДействуетДо > &ДатаНачала
		|	И ДоговорыКонтрагентов.ВидДоговора = &ДоговорАбонентскоеОбслуживание
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	СУММА(РеализацияТоваровУслугУслуги.Количество) КАК КоличествоПроведеноСпециалист,
		|	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК СуммаПроведеноСпециалист
		|ПОМЕСТИТЬ ВТ_РаботаСпециалиста
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И РеализацияТоваровУслугУслуги.Номенклатура = &НоменклатураРаботаСпециалиста
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ДоговорАбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Проведен = Истина
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Контрагент,
		|	РеализацияТоваровУслуг.Организация,
		|	РеализацияТоваровУслуг.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК СуммаПроведеноАбонплата
		|ПОМЕСТИТЬ ВТ_АбонентскоеОбслуживание
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И РеализацияТоваровУслугУслуги.Номенклатура = &НоменклатураАбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ДоговорАбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Проведен = Истина
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Контрагент,
		|	РеализацияТоваровУслуг.Организация,
		|	РеализацияТоваровУслуг.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Договоры.Договор КАК Договор,
		|	ВТ_Договоры.Контрагент КАК Контрагент,
		|	ВТ_Договоры.Организация КАК Организация,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) -
		|		ЕСТЬNULL(ВТ_РаботаСпециалиста.КоличествоПроведеноСпециалист, 0)) КАК КоличествоЧасовКПроведению,
		|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) -
		|		ЕСТЬNULL(ВТ_РаботаСпециалиста.СуммаПроведеноСпециалист, 0)) КАК СуммаПоСпециалистуКПроведению,
		|	СУММА(ЕСТЬNULL(ВТ_Договоры.АбонентскаяПлата, 0) - ЕСТЬNULL(ВТ_АбонентскоеОбслуживание.СуммаПроведеноАбонплата,
		|		0)) КАК СуммаАбонплатаКПроведению,
		|	СУММА(ЕСТЬNULL(ВТ_Договоры.СтоимостьЧасаРаботы, 0)) КАК СтоимостьЧасаРаботы,
		|	СУММА(ЕСТЬNULL(ВТ_Договоры.АбонентскаяПлата, 0)) КАК АбонентскаяПлата
		|ИЗ
		|	ВТ_Договоры КАК ВТ_Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаботаСпециалиста КАК ВТ_РаботаСпециалиста
		|		ПО ВТ_Договоры.Договор = ВТ_РаботаСпециалиста.Договор
		|		И ВТ_Договоры.Контрагент = ВТ_РаботаСпециалиста.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АбонентскоеОбслуживание КАК ВТ_АбонентскоеОбслуживание
		|		ПО ВТ_Договоры.Договор = ВТ_АбонентскоеОбслуживание.Договор
		|		И ВТ_Договоры.Контрагент = ВТ_АбонентскоеОбслуживание.Контрагент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ДатаНачала, &ДатаКонца,,
		|			Договор.ВидДоговора = &ДоговорАбонентскоеОбслуживание) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ПО ВТ_Договоры.Договор = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
		|		И ВТ_Договоры.Контрагент = ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент
		|ГДЕ
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) -
		|		ЕСТЬNULL(ВТ_РаботаСпециалиста.СуммаПроведеноСпециалист, 0) <> 0
		|	ИЛИ ЕСТЬNULL(ВТ_Договоры.АбонентскаяПлата, 0) - ЕСТЬNULL(ВТ_АбонентскоеОбслуживание.СуммаПроведеноАбонплата, 0) <> 0
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Договоры.Договор,
		|	ВТ_Договоры.Контрагент,
		|	ВТ_Договоры.Организация";
		
		
		Запрос.УстановитьПараметр("ДоговорАбонентскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
		Запрос.УстановитьПараметр("НоменклатураАбонентскоеОбслуживание", НоменклатураАбонентскаяПлата);
		Запрос.УстановитьПараметр("НоменклатураРаботаСпециалиста", НоменклатураРаботыСпециалиста);
		
		Если ТипЗнч(Ссылка) <> Тип("СтандартныйПериод") Тогда 
			
			СтрокаДляПоиска = "ПометкаУдаления";
			Позиция = СтрНайти(Запрос.Текст, СтрокаДляПоиска, НаправлениеПоиска.СНачала);
			ТекстДляВставки = "
			|	И ДоговорыКонтрагентов.Ссылка = &Договор
			|	И ДоговорыКонтрагентов.Владелец = &Контрагент
			|	И ДоговорыКонтрагентов.Организация = &Организация";
			Запрос.Текст = Лев(Запрос.Текст, Позиция + 14) + ТекстДляВставки + Сред(Запрос.Текст, Позиция + 15); 
			
			
			Запрос.УстановитьПараметр("Договор", Ссылка.Договор);
			Запрос.УстановитьПараметр("Контрагент", Ссылка.Контрагент);
			Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
			Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Ссылка.Дата));
			Запрос.УстановитьПараметр("ДатаКонца", Ссылка.Дата); 
			
		Иначе
			
			Запрос.УстановитьПараметр("ДатаКонца", Ссылка.ДатаОкончания);
			Запрос.УстановитьПараметр("ДатаНачала", Ссылка.ДатаНачала);
			
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если  ТипЗнч(Ссылка) = Тип("СтандартныйПериод") Тогда
				
				РеализацияУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				РеализацияУслуг.Дата = Ссылка.ДатаОкончания; 
				РеализацияУслуг.Контрагент = ВыборкаДетальныеЗаписи.Контрагент; 
				РеализацияУслуг.Договор = ВыборкаДетальныеЗаписи.Договор;
				РеализацияУслуг.Организация = ВыборкаДетальныеЗаписи.Организация;
				РеализацияУслуг.Основание = ВыборкаДетальныеЗаписи.Договор;
				
				Если ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению <> 0 И ВыборкаДетальныеЗаписи.АбонентскаяПлата <> 0 Тогда  
					
					НоваяСтрока = РеализацияУслуг.Услуги.Добавить();
					НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
					НоваяСтрока.Количество = 1;
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению;
					НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению;
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.СуммаПоСпециалистуКПроведению <> 0 Тогда  
					
					НоваяСтрока = РеализацияУслуг.Услуги.Добавить();
					НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
					НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасовКПроведению;
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
					НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаПоСпециалистуКПроведению;
					
				КонецЕсли;
				
				РеализацияУслуг.Записать(РежимЗаписиДокумента.Проведение);
				
			Иначе 
				
				Документ = Ссылка.Документ;
				Объект = Документ.ПолучитьОбъект();
				ТабличнаяЧасть = Объект.Услуги;
				ТабличнаяЧасть.Очистить();
				Объект.Дата = Ссылка.Дата;
				
				Если ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению <> 0 И ВыборкаДетальныеЗаписи.АбонентскаяПлата <> 0 Тогда  
					
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
					НоваяСтрока.Количество = 1;
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению;
					НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаАбонплатаКПроведению;
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.СуммаПоСпециалистуКПроведению <> 0 Тогда  
					
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
					НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоЧасовКПроведению;
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
					НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаПоСпециалистуКПроведению;
					
				КонецЕсли;
				
				Объект.Записать();
				
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецПроцедуры
	//--
	
	#КонецОбласти
	
#КонецЕсли