#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытийФормы
	
	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	КонецПроцедуры
	
	&НаСервере
	Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ПослеЗаписи(ПараметрыЗаписи)
		ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
	
	&НаКлиенте
	Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
		
		ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
		
		ГодДляПроверки = ГОД(ТекущиеДанные.ДатаНачала);
		
		Если ГодДляПроверки <> Объект.Год Тогда  
			
			НомерСтроки = ТекущиеДанные.НомерСтроки - 1;
			
			Текст = "Период отпуска не соответсвует вводимому году";
			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,,"Объект.ОтпускаСотрудников[НомерСтроки].ДатаНачала");
			
		КонецЕсли;
		
		ПроверитьПериодНаКорректность(ТекущиеДанные);
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
		
		ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
		
		ГодДляПроверки = ГОД(ТекущиеДанные.ДатаОкончания);
		
		Если ГодДляПроверки <> Объект.Год Тогда   
			
			НомерСтроки = ТекущиеДанные.НомерСтроки - 1;
			
			Текст = "Период отпуска не соответсвует вводимому году";
			ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,,"Объект.ОтпускаСотрудников[НомерСтроки].ДатаОкончания");
			
		КонецЕсли;
		
		ПроверитьПериодНаКорректность(ТекущиеДанные);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	#Область ОбработчикиКомандФормы
	
	&НаКлиенте
	Процедура ПроверитьПревышение(Команда)
		
		ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ПревышениеОтпусков = ПроверкаПревышенияОтпусковНаСервере(); 
		
		Для Каждого Значение ИЗ ПревышениеОтпусков Цикл 
			
			ОформитьНаСервере(Значение.Сотрудник);
			
		КонецЦикла;
		
	КонецПроцедуры 
	
	&НаКлиенте
	Процедура АнализГрафика(Команда)
		
		Адрес = АнализГрафикаНаСервере(); 
		
		ПараметрыФормы = Новый Структура("Адрес", Адрес);
		
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
	#Область СлужебныеПроцедурыИФункции
	
	#Область ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	&НаКлиенте
	Процедура Подключаемый_ВыполнитьКоманду(Команда)
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
		ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	КонецПроцедуры
	
	&НаСервере
	Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Подключаемый_ОбновитьКоманды()
		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
	&НаСервере
	Функция ПроверкаПревышенияОтпусковНаСервере()
		
		УсловноеОформление.Элементы.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК Дни
		|ПОМЕСТИТЬ ВТ_Дни
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Дни.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_Дни КАК ВТ_Дни
		|ГДЕ
		|	ВТ_Дни.Дни > 28";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
		
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса);
		
	Конецфункции
	
	&НаСервере
	Процедура ОформитьНаСервере(Сотрудник)
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый);
		
		ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Сотрудник;
		ЭлементУсловия.Использование = Истина;
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтпускаСотрудниковСотрудник.Имя);
		ОформляемоеПоле.Использование = Истина;
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ПроверитьПериодНаКорректность(ТекущиеДанные)
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
			
			Если ТекущиеДанные.ДатаНачала > ТекущиеДанные.ДатаОкончания Тогда
				
				НомерСтроки = ТекущиеДанные.НомерСтроки - 1;
				
				Текст = "Дата окончания отпуска меньше даты начала";
				ОбщегоНазначенияКлиент.СообщитьПользователю(Текст,,"Объект.ОтпускаСотрудников[НомерСтроки].ДатаНачала");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	&НаСервере
	Функция АнализГрафикаНаСервере()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
		
		Адрес = ПоместитьВоВременноеХранилище(РезультатЗапроса, УникальныйИдентификатор);  
		
		Возврат Адрес;
		
	КонецФункции
	
	#КонецОбласти
	
#КонецЕсли