#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Для Каждого Строка Из СписокСотрудников Цикл  
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
			Движение.ПериодРегистрации = Дата;
			//Движение.ПериодДействияНачало = Строка.ДатаНачала;
			//Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = Строка.СуммаПремии;
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = Строка.СуммаПремии;
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение; 
			Движение.База = Строка.СуммаПремии;
			Движение.ВидРасчетаБаза = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
			НДФЛ = Движение.База * 13 / 100;
			Движение.Результат = НДФЛ; 
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = НДФЛ;
			
		КонецЦикла; 
		
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		Движения.ВКМ_Удержания.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
