#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	Специалист = Справочники.ВКМ_Сотрудники.НайтиПоРеквизиту("Пользователь", Пользователь);
	
	Планировщик.ЕдиницаПериодическогоВарианта = ТипЕдиницыШкалыВремени.Час;
	
	Планировщик.КратностьПериодическогоВарианта = 24;
	
	Планировщик.ОтступСНачалаПереносаШкалыВремени = 8;
	Планировщик.ОтступСКонцаПереносаШкалыВремени = 4;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	ДатаС = НачалоНедели(ТекущаяДатаСеанса());
	ДатаПо = КонецНедели(ТекущаяДатаСеанса()); //- 2 * 24 * 60 * 60;
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(ДатаС, ДатаПо);
	
	ОбновитьПланировщик();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиентов" Тогда
		
		ОбновитьПланировщик();
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата", ТекущаяДата());
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Начало); 
	ЗначенияЗаполнения.Вставить("ВремяНачалаРабот", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРабот", Конец);
	ЗначенияЗаполнения.Вставить("Специалист", Специалист);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиентов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПланировщик();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПланировщик() 
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	НачалоПериода = ДатаС;
	КонецПериода = ДатаПо; //- 2 * 24 * 60 * 60;  
	
	Планировщик.Элементы.Очистить();
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентов.Ссылка КАК Ссылка,
	|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
	|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Заказы = РезультатЗапроса.Выбрать();
	
	Пока Заказы.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Специалист) ИЛИ Заказы.Специалист = Специалист Тогда 
			
			ДатаНачала = НачалоДня(Заказы.ДатаПроведенияРабот) + Час(Заказы.ВремяНачалаРабот)*60*60 + Минута(Заказы.ВремяНачалаРабот)*60;
			ДатаОкончания = НачалоДня(Заказы.ДатаПроведенияРабот) + Час(Заказы.ВремяОкончанияРабот)*60*60 + Минута(Заказы.ВремяОкончанияРабот)*60;
			НовыйЭлемент = Планировщик.Элементы.Добавить(ДатаНачала, ДатаОкончания);
			НовыйЭлемент.Значение = Заказы.Ссылка;
			НовыйЭлемент.Текст = Заказы.Специалист;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Заголовок = "Обслуживание клиентов " + ПредставлениеПериода(НачалоПериода, КонецПериода);
	
КонецПроцедуры

#КонецОбласти