#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс	
	
	Процедура ДобавитьУведомлениеВСправочник() Экспорт
		
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		
		Текст = СтрШаблон("Изменения в графике у %1: %2 с %3 до %4 проведение работ в %5", Специалист,
		Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"), Формат(ВремяНачалаРабот, "ДФ=ЧЧ:мм"),
		Формат(ВремяОкончанияРабот, "ДФ=ЧЧ:мм"), Клиент);
		
		НовыйЭлемент.ТекстСообщения = Текст;
		
		НовыйЭлемент.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти 
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ,Режим)
		
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
		
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДействуетС КАК ДействуетС,
		|	ДоговорыКонтрагентов.ВКМ_ДействуетДо КАК ДействуетДо,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиентов.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтоимостьЧасаРаботы = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
			
			Если НЕ ВыборкаДетальныеЗаписи.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Проведение невозможно: должен быть выбран договор на абонентское обслуживание";
				Сообщение.Сообщить();
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
			Если Дата < ВыборкаДетальныеЗаписи.ДействуетС ИЛИ Дата > ВыборкаДетальныеЗаписи.ДействуетДо Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Проведение невозможно: данный договор недействительный";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
			Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Сотрудник", Специалист);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Для Каждого ТекСтрокаВыполненныеРаботы ИЗ ВыполненныеРаботы Цикл
				
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = Дата;
				Движение.Сотрудник = Специалист;
				Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы
				* ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
				
			КонецЦикла;	
			
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		Если ЭтотОбъект.ЭтоНовый() = Истина Тогда
			
			ДобавитьУведомлениеВСправочник();
			
		Иначе 
			
			СтарыйОбъект = Ссылка.ПолучитьОбъект();
			
			Если ЭтотОбъект.Специалист <> СтарыйОбъект.Специалист
				ИЛИ ЭтотОбъект.ДатаПроведенияРабот <> СтарыйОбъект.ДатаПроведенияРабот
				ИЛИ ЭтотОбъект.ВремяНачалаРабот <> СтарыйОбъект.ВремяНачалаРабот 
				ИЛИ ЭтотОбъект.ВремяОкончанияРабот <> СтарыйОбъект.ВремяОкончанияРабот
				ИЛИ ЭтотОбъект.Клиент <> СтарыйОбъект.Клиент Тогда
				
				ДобавитьУведомлениеВСправочник();
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли  

