#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Для Каждого Строка Из ПолученныеДанные Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник.Наименование;
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск"); 
						
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти