#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		СформироватьДвижение();
		
		РассчитатьОклад(); 
		
		РассчитатьОтпускные(); 
		
		РассчитатьПроцент(); 
		
		РассчитатьУдержания();
		
		СформироватьДвиженияПоРегиструНакопления();
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура СформироватьДвижение()
		
		СформироватьДвиженияПоОкладу();    
		СформироватьДвиженияОтпускные();
		СформироватьДвиженияДополнительныеНачисления(); 
		
		Движения.ВКМ_ОсновныеНачисления.Записать();
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		
	КонецПроцедуры
	
	Процедура СформироватьДвиженияПоОкладу()
		
		Для Каждого Строка Из Начисления Цикл  
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
				Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
				Движение.ВидРасчета = Строка.ВидРасчета;
				Движение.ПериодРегистрации = Дата;
				Движение.ПериодДействияНачало = Строка.ДатаНачала;
				Движение.ПериодДействияКонец = Строка.ДатаОкончания;
				Движение.Сотрудник = Строка.Сотрудник;
				Движение.Подразделение = Строка.Подразделение; 
				
			КонецЕсли;    
			
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура РассчитатьОклад()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Подразделение КАК Подразделение,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			ВидРасчета = &Оклад
		|				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";
		
		Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			Движение.Размер = ВыборкаДетальныеЗаписи.Оклад;
			Движение.Результат = Движение.Размер / ВыборкаДетальныеЗаписи.План * ВыборкаДетальныеЗаписи.Факт;
			Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт; 
			
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать( ,Истина);
		
	КонецПроцедуры 
	
	Процедура СформироватьДвиженияОтпускные()
		
		Для Каждого Строка Из Начисления Цикл  
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные Тогда
				
				Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
				Движение.ВидРасчета = Строка.ВидРасчета;
				Движение.ПериодРегистрации = Дата;
				Движение.ПериодДействияНачало = Строка.ДатаНачала;
				Движение.ПериодДействияКонец = Строка.ДатаОкончания;
				Движение.Сотрудник = Строка.Сотрудник;
				Движение.Подразделение = Строка.Подразделение;
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -13));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаОкончания, -1));
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура СформироватьДвиженияДополнительныеНачисления()
		
		Для Каждого Строка Из Начисления Цикл  
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Процент 
				И Строка.Подразделение = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда
				
				Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
				Движение.ВидРасчета = Строка.ВидРасчета;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Строка.Сотрудник;
				Движение.Подразделение = Строка.Подразделение; 
				
			КонецЕсли;    
			
		КонецЦикла;
		
	КонецПроцедуры 
	
	Процедура РассчитатьОтпускные()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДнейБаза,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
		|	РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисления.ПериодДействияНачало, ВКМ_ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК ДниОтпуска
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|				&Измерение,
		|				&Измерение,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпускные) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
		|				&Измерение,
		|				&Измерение,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпускные) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Отпускные) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпускные";
		//
		Запрос.УстановитьПараметр("Отпускные", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Измерение = Новый Массив;
		Измерение.Добавить("Подразделение");
		Измерение.Добавить("Сотрудник");
		Запрос.УстановитьПараметр("Измерение", Измерение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			
			Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.ДниОтпуска;
			
			Если ВыборкаДетальныеЗаписи.ОтработаноДнейБаза = 0 Тогда
				Движение.Результат = 0;
				Продолжить;
			КонецЕсли;
			
			Движение.Размер = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп) / ВыборкаДетальныеЗаписи.ОтработаноДнейБаза;
			Движение.Результат = Движение.ОтработаноДней * Движение.Размер;
			
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
		
	КонецПроцедуры
	
	Процедура РассчитатьПроцент()
		
		Запрос = Новый Запрос;
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплате
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	И ВКМ_ДополнительныеНачисления.ВидРасчета = &Процент";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("ДатаКонца", КонецМесяца(Дата));
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
		Запрос.УстановитьПараметр("Процент", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Процент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			
			Движение.Результат = ВыборкаДетальныеЗаписи.СуммаКОплате;
			
		КонецЦикла;
		
		Движения.ВКМ_ДополнительныеНачисления.Записать(, Истина);
		
		
	КонецПроцедуры
	
	Процедура РассчитатьУдержания()
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
		|	ВКМ_ДополнительныеНачисления.Результат КАК Результат,
		|	ВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник,
		|	ВКМ_ОсновныеНачисления.Подразделение,
		|	ВКМ_ОсновныеНачисления.Результат,
		|	ВКМ_ОсновныеНачисления.ВидРасчета
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Результат <> 0 Тогда
				
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Подразделение = ВыборкаДетальныеЗаписи.Подразделение; 
				Движение.База = ВыборкаДетальныеЗаписи.Результат;
				Движение.ВидРасчетаБаза = ВыборкаДетальныеЗаписи.ВидРасчета;
				Движение.Результат = Движение.База * 13 / 100;    
				
			КонецЕсли;
			
		КонецЦикла;
		
		Движения.ВКМ_Удержания.Записать();
		
	КонецПроцедуры
	
	Процедура СформироватьДвиженияПоРегиструНакопления() 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисления.Подразделение КАК Подразделение,
		|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0)) КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Подразделение,
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник,
		|	ВКМ_ДополнительныеНачисления.Подразделение,
		|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0))
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Подразделение,
		|	ВКМ_ДополнительныеНачисления.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.Сотрудник,
		|	ВКМ_Удержания.Подразделение,
		|	СУММА(ЕСТЬNULL(-ВКМ_Удержания.Результат, 0))
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_Удержания.Подразделение,
		|	ВКМ_Удержания.Сотрудник";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить(); 
		
		КолонкиГруппировки = "Сотрудник, Подразделение";
		КолонкиСуммирования = "Результат";

		ВыборкаДетальныеЗаписи.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
		
		Для Каждого Строка Из ВыборкаДетальныеЗаписи Цикл 
			
			Если Строка.Результат <> 0 Тогда
				
				Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сотрудник = Строка.Сотрудник;
				Движение.Подразделение = Строка.Подразделение;
				Движение.Результат = Строка.Результат;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
