
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ДобавитьРеквизитыАбонентскогоОбслуживания();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_ДействуетС) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить период действия",,"Объект.ВКМ_ДействуетС");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_ДействуетДо) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить период действия",,"Объект.ВКМ_ДействуетДо");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_АбонентскаяПлата) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить абонентскую плату",,"Объект.ВКМ_АбонентскаяПлата");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_СтоимостьЧасаРаботы) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить стоимость часа работ",,"Объект.ВКМ_СтоимостьЧасаРаботы");
			
		КонецЕсли;
		
	Иначе 
		
		Объект.ВКМ_ДействуетС = Неопределено;
		Объект.ВКМ_ДействуетДо = Неопределено;
		Объект.ВКМ_АбонентскаяПлата = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ДобавитьРеквизитыАбонентскогоОбслуживания();
		
	Иначе
		
		УдалитьРеквизитыАбонентскогоОбслуживания();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьРеквизитыАбонентскогоОбслуживания()
	
	Элемент = Элементы.Вставить("ВКМ_ДействуетС", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
	Элемент.Заголовок = "Действует с";
	
	Элемент = Элементы.Вставить("ВКМ_ДействуетДо", Тип("ПолеФормы"), Элементы.ГруппаПериодДействия);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_ДействуетДо";
	Элемент.Заголовок = "до";
	
	Элемент = Элементы.Вставить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), Элементы.ГруппаТарифы);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	Элемент.Заголовок = "Абонентская плата";
	
	Элемент = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаТарифы);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	Элемент.Заголовок = "Стоимость часа работы";
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьРеквизитыАбонентскогоОбслуживания()
	
	ЭлементУдаления = Элементы.Найти("ВКМ_ДействуетС");
	
	Если ЭлементУдаления <> Неопределено Тогда
		Элементы.Удалить(ЭлементУдаления);
	КонецЕсли;  
	
	ЭлементУдаления = Элементы.Найти("ВКМ_ДействуетДо");
	
	Если ЭлементУдаления <> Неопределено Тогда
		Элементы.Удалить(ЭлементУдаления);
	КонецЕсли;
	
	ЭлементУдаления = Элементы.Найти("ВКМ_АбонентскаяПлата");
	
	Если ЭлементУдаления <> Неопределено Тогда
		Элементы.Удалить(ЭлементУдаления);
	КонецЕсли;
	
	ЭлементУдаления = Элементы.Найти("ВКМ_СтоимостьЧасаРаботы");
	
	Если ЭлементУдаления <> Неопределено Тогда
		Элементы.Удалить(ЭлементУдаления);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти