#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Элементы.ЗаполнитьВыплаты.ЦветФона = Новый Цвет(255, 102, 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьВыплаты(Команда)
	
	ЗаполнитьВыплатыНаСервере();
	Элементы.ЗаполнитьВыплаты.ЦветФона = Новый Цвет(255, 255, 153); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВыплатыНаСервере()
	
	Объект.Выплаты.Очистить();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ОчиститьРегистр();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.РезультатОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = Объект.Выплаты.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
		НоваяСтрока.Начислено = ВыборкаДетальныеЗаписи.Сумма;
		НоваяСтрока.Выплачено = ВыборкаДетальныеЗаписи.Сумма;
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти